app/views/movies/show.html.haml

= link_to 'Edit', edit_movie_path(@movie)
= link_to 'Find Movies With Same Director', movies_path(:action => "similar", :id => Movie.find_by_title(@movie.title).id)
---
SELECT "movies".* FROM "movies" WHERE "movies"."title" = 'Star Wars' LIMIT 1