app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'PhilPhilson' LIMIT 1
---
def similar_movies
	puts params[:id]
	@movies = Movie.find_all_by_director(Movie.find(params[:id]).director)